scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#include <Arduino.h>
#include <ctype.h>
#include "DevicePin.h"
#include <map>
#include <vector>
std::map<int, DevicePin*> devicePins;
DeviceConfiguration deviceConfig;
#include <FS.h>
#include <LittleFS.h>
#include <SD.h>
#if defined(ARDUINO_ARCH_ESP8266)
#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#else
#include <HTTPClient.h>
#include <WiFi.h>
#include <ESPmDNS.h>
#endif
#include <ESPAsyncWebServer.h>
#include "https_service.h"

#include <ArduinoJson.h>
#include "ConfigSchema.h"
#include "NodeConfig.h"
#include "NodeDiscovery.h"
#include "ffs/FederatedFileSystem.h"
#include "ffs/FederatedFileSystemRoutes.h"
#include "profile_config.h"
#include "broker_client.h"
#include "provision_routes.h"
#include "wifi_provisioning.h"
#include "serial_provisioning.h"
#include "cluster_routes.h"
#include "udp_announcement.h"
#include "udp_runtime.h"
#include "main_globals.h"
#include "time_authority.h"
#include "unique_id_service.h"

#ifdef ENABLE_PMACHINE
#include "pmachine.h"
#include "pmachine_routes.h"
#endif

#ifdef ENABLE_CAMERA
#include "CameraService.h"
#include "camera_routes.h"
#endif

#ifdef ENABLE_DISPLAY
#include "DisplayService.h"
#ifndef DISPLAY_NO_LVGL
#include "DDLRenderer.h"
#endif
#endif

#ifdef ENABLE_AWS_IOT
#include "aws_iot_routes.h"
#endif

#ifdef ENABLE_PRINTER_SCANNER
#include "PrinterService.h"
#include "printer_routes.h"
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
#include "BluetoothService.h"
#include "bluetooth_routes.h"
#endif

#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
#include "bluetooth_control_plane.h"
#endif

#if defined(ENABLE_BLUETOOTH_AUDIO_TTS) && defined(ENABLE_BLUETOOTH_DEVICES)
#include "BluetoothAudioTtsService.h"
#endif

#ifdef ENABLE_EVENT_SCHEDULER
#include "EventScheduler.h"
#endif

String nodeName = "ESP32-VM";
NodeConfig nodeConfig;
WifiConfig wifiConfig;
ClusterConfig clusterConfig;
FederatedFileSystem federatedFS;
bool ffsUp = false;

#if defined(ENABLE_DISPLAY) && !defined(DISPLAY_NO_LVGL)
bool displayStatusDashboardActive = false;
unsigned long lastDisplayStatusUpdateMs = 0;

void updateDisplayStatusDashboard(bool force = false) {
    if (!displayStatusDashboardActive || !displayService.isInitialized()) return;

    const unsigned long now = millis();
    if (!force && now - lastDisplayStatusUpdateMs < 1000) return;
    lastDisplayStatusUpdateMs = now;

    const bool wifiConnected = WiFi.status() == WL_CONNECTED;
    String transport = "Transport: offline";
    if (wifiConnected) {
        transport = "Transport: WiFi";
    }
#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
    else if (bluetoothControlPlaneClientConnected()) {
        transport = "Transport: BLE fallback";
    }
#endif

    String address = "Address: unavailable";
    if (wifiConnected) {
        address = "IP: " + WiFi.localIP().toString();
    } else {
        const IPAddress apAddress = WiFi.softAPIP();
        if (apAddress != IPAddress(0, 0, 0, 0)) {
            address = "AP: " + apAddress.toString();
        }
    }

    const unsigned long uptimeSeconds = now / 1000;
    const unsigned long hours = uptimeSeconds / 3600;
    const unsigned long minutes = (uptimeSeconds / 60) % 60;
    const unsigned long seconds = uptimeSeconds % 60;

    ddlRenderer.updateTextWidget("transportStatus", transport);
    ddlRenderer.updateTextWidget("addressStatus", address);
    ddlRenderer.updateTextWidget(
        "uptimeStatus",
        String("Uptime: ") + hours + "h " + minutes + "m " + seconds + "s"
    );
    ddlRenderer.updateTextWidget(
        "heapStatus",
        String("Free heap: ") + ESP.getFreeHeap() + " bytes"
    );
}
#endif
AsyncWebServer server(80);
DevicePin* devicePin = nullptr;
int devicePinNumber = 2;
#ifdef ENABLE_CAMERA
// GPIO 5 is used by camera (Y2 data line), move relay to GPIO 12
int relayPinNumber = 12;
#else
int relayPinNumber = 5;
#endif
bool relayStateOn = false;
std::map<String, bool> serviceBusyMap;

namespace {
bool gLittleFsInitialized = false;
bool gMdnsInitialized = false;
String gMdnsHost;

bool ensureLittleFsInitialized() {
    if (gLittleFsInitialized) return true;

#if defined(ARDUINO_ARCH_ESP8266)
    if (LittleFS.begin()) {
        gLittleFsInitialized = true;
        return true;
    }
#else
    if (LittleFS.begin()) {
        gLittleFsInitialized = true;
        return true;
    }
    // Retry with format to recover uninitialized/corrupt local FS on ESP32.
    if (LittleFS.begin(true)) {
        gLittleFsInitialized = true;
        return true;
    }
#endif

    return false;
}

String toMdnsHostLabel(const String& raw) {
    String host = raw;
    host.trim();
    host.toLowerCase();
    String out;
    out.reserve(host.length());
    for (size_t i = 0; i < host.length(); ++i) {
        const char c = host[i];
        if ((c >= 'a' && c <= 'z') || (c >= '0' && c <= '9') || c == '-') {
            out += c;
        } else if (c == ' ' || c == '_' || c == '.') {
            out += '-';
        }
    }
    while (out.startsWith("-")) out.remove(0, 1);
    while (out.endsWith("-")) out.remove(out.length() - 1);
    if (out.length() == 0) out = "pulse-node";
    if (out.length() > 63) out = out.substring(0, 63);
    return out;
}

void startOrRefreshMdns(const String& preferredNodeName) {
    if (WiFi.status() != WL_CONNECTED) {
        return;
    }

    const String host = toMdnsHostLabel(preferredNodeName);
    const bool hostChanged = gMdnsHost.length() && gMdnsHost != host;

    if (gMdnsInitialized && hostChanged) {
        MDNS.end();
        gMdnsInitialized = false;
    }

    if (!gMdnsInitialized) {
        if (!MDNS.begin(host.c_str())) {
            Serial.printf("[mDNS] Failed to start for host %s.local\n", host.c_str());
            return;
        }
        MDNS.addService("http", "tcp", 80);
        MDNS.addService("https", "tcp", 443);
        gMdnsInitialized = true;
        gMdnsHost = host;
        Serial.printf("[mDNS] Advertising as %s.local\n", gMdnsHost.c_str());
        return;
    }

#if defined(ARDUINO_ARCH_ESP8266)
    MDNS.update();
#endif
}
}

#ifndef DOORBELL_BUTTON_PIN
#define DOORBELL_BUTTON_PIN 13
#endif

#ifndef DOORBELL_BUTTON_ACTIVE_LEVEL
#define DOORBELL_BUTTON_ACTIVE_LEVEL LOW
#endif

