scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#ifndef DOORBELL_BUTTON_DEBOUNCE_MS
#define DOORBELL_BUTTON_DEBOUNCE_MS 250
#endif

#if defined(ENABLE_DOORBELL_CAMERA)
bool doorbellButtonLastReading = false;
bool doorbellButtonStablePressed = false;
unsigned long doorbellButtonLastChangeMs = 0;
unsigned long doorbellLastMotionCheckMs = 0;
String doorbellDisplayStreamHost;
uint16_t doorbellDisplayStreamPort = 80;
unsigned long doorbellDisplayStreamIntervalMs = 500;
unsigned long doorbellDisplayStreamLastFrameMs = 0;
unsigned long doorbellDisplayStreamFramesSent = 0;
unsigned long doorbellDisplayStreamFailures = 0;
int doorbellDisplayStreamLastStatus = 0;
#endif

#if defined(ENABLE_DOORBELL_DISPLAY)
String doorbellLastAlertType;
String doorbellLastSnapshotUrl;
unsigned long doorbellLastAlertMs = 0;
#endif

#ifdef ENABLE_PMACHINE
pmachine::PMachine pm;
#endif

const char* firmwareVersion = "2026.06.06";
const char* firmwareBuildStamp = __DATE__ " " __TIME__;
const char* deviceRole = DEVICE_ROLE;

constexpr unsigned long NODE_BEACON_ACKED_INTERVAL_MS = 60000;
constexpr unsigned long NODE_BEACON_UNACKED_INTERVAL_MS = 10000;

const char* preferredTaskType = PROFILE_PREFERRED_TASK_TYPE;
const char* firmwareTrack = FIRMWARE_TRACK;
const size_t maxMessageBytes = PROFILE_MAX_MESSAGE_BYTES;
const size_t maxConcurrentTasks = PROFILE_MAX_CONCURRENT_TASKS;

struct SupervisorProbeState {
    String name;
    String url;
    bool healthy = false;
    int lastStatusCode = -1;
    unsigned long lastCheckMs = 0;
    unsigned long okCount = 0;
    unsigned long failCount = 0;
    String lastError;
};

bool supervisorEnabled = SUPERVISOR_DEFAULT_ENABLED != 0;
bool supervisorRequireFrontend = SUPERVISOR_REQUIRE_FRONTEND != 0;
unsigned long supervisorCheckIntervalMs = SUPERVISOR_CHECK_INTERVAL_MS;
unsigned long supervisorLastRunMs = 0;
SupervisorProbeState supervisorBackendProbe;
SupervisorProbeState supervisorFrontendProbe;
String supervisorHeartbeatUrl = SUPERVISOR_HEARTBEAT_URL;
int supervisorLastHeartbeatStatusCode = -1;
unsigned long supervisorLastHeartbeatPostMs = 0;
unsigned long supervisorHeartbeatOkCount = 0;
unsigned long supervisorHeartbeatFailCount = 0;
String supervisorLastHeartbeatError;
const char* supervisorConfigPath = "/supervisor-config.json";

bool supervisorOverallHealthy();
void appendSupervisorStatus(JsonObject obj);
void announcePresence();

// Declared later in this translation unit; forward declare for early route lambdas.
extern uint16_t runtimeUdpParentPort;
extern uint16_t runtimeUdpSiblingPort;

bool parseBoolValue(const String& value) {
    return value == "1" || value.equalsIgnoreCase("true") || value.equalsIgnoreCase("yes") || value.equalsIgnoreCase("on");
}

void saveSupervisorConfig() {
    JsonDocument doc;
    doc["enabled"] = supervisorEnabled;
    doc["requireFrontend"] = supervisorRequireFrontend;
    doc["intervalMs"] = static_cast<uint32_t>(supervisorCheckIntervalMs);
    doc["backendUrl"] = supervisorBackendProbe.url;
    doc["frontendUrl"] = supervisorFrontendProbe.url;
    doc["heartbeatUrl"] = supervisorHeartbeatUrl;

    File f = LittleFS.open(supervisorConfigPath, "w");
    if (!f) {
        Serial.println("[SUPERVISOR] Failed to open config file for write");
        return;
    }

    serializeJson(doc, f);
    f.close();
}

void loadSupervisorConfig() {
    // Open in append+read mode so first boot creates the file silently
    // instead of emitting a VFS missing-file error.
    File f = LittleFS.open(supervisorConfigPath, "a+");
    if (!f) {
        Serial.println("[SUPERVISOR] Failed to open config file for read");
        return;
    }

    if (f.size() == 0) {
        f.close();
        return;
    }

    f.seek(0, SeekSet);

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) {
        Serial.println("[SUPERVISOR] Failed to parse config file; using defaults");
        return;
    }

    if (doc["enabled"].is<bool>()) {
        supervisorEnabled = doc["enabled"].as<bool>();
    }
    if (doc["requireFrontend"].is<bool>()) {
        supervisorRequireFrontend = doc["requireFrontend"].as<bool>();
    }
    if (doc["intervalMs"].is<unsigned long>()) {
        const unsigned long requested = doc["intervalMs"].as<unsigned long>();
        if (requested >= 1000 && requested <= 120000) {
            supervisorCheckIntervalMs = requested;
        }
    }
    if (doc["backendUrl"].is<const char*>()) {
        supervisorBackendProbe.url = doc["backendUrl"].as<const char*>();
    }
    if (doc["frontendUrl"].is<const char*>()) {
        supervisorFrontendProbe.url = doc["frontendUrl"].as<const char*>();
    }
    if (doc["heartbeatUrl"].is<const char*>()) {
        supervisorHeartbeatUrl = doc["heartbeatUrl"].as<const char*>();
    }
}

bool isSupervisorRole() {
    return String(deviceRole).equalsIgnoreCase("sentinel") || String(deviceRole).equalsIgnoreCase("supervisor");
}

void configureSupervisorTargets() {
    supervisorBackendProbe.name = "backend";
    supervisorBackendProbe.url = SUPERVISOR_BACKEND_URL;
    supervisorFrontendProbe.name = "frontend";
    supervisorFrontendProbe.url = SUPERVISOR_FRONTEND_URL;
}

String computeNodeCapabilityHash() {
    String hash;
    hash.reserve(160);
    hash += firmwareVersion;
    hash += '|';
    hash += firmwareBuildStamp;
    hash += '|';
    hash += deviceRole;
    hash += '|';
    hash += preferredTaskType;
    hash += '|';
    hash += firmwareTrack;
    hash += '|';
    hash += '0';
    hash += '|';
    hash += isSupervisorRole() ? '1' : '0';
    hash += '|';
    hash += ffsUp ? '1' : '0';
#ifdef ENABLE_PMACHINE
    hash += "|pmachine:1";
#else
    hash += "|pmachine:0";
#endif
#ifdef ENABLE_TIME_AUTHORITY
    hash += "|timeAuthority:1";
    #if TIME_AUTHORITY_COOP_ENABLED
    hash += "|timeAuthorityCoop:1";
    #else
    hash += "|timeAuthorityCoop:0";
    #endif
#else
    hash += "|timeAuthority:0";
#endif
#ifndef DISABLE_UNIQUE_ID_SERVICE
    hash += "|uniqueId:1";
#else
    hash += "|uniqueId:0";
#endif
    hash += '|';
    hash += nodeName;
    return hash;
}

#if defined(ENABLE_DOORBELL_CAMERA)
void emitDoorbellAlert(const char* eventType, const MotionEvent* motionEvent = nullptr) {
    JsonDocument doc;
    doc["kind"] = "doorbellAlert";
    doc["eventType"] = eventType;
    doc["nodeName"] = nodeName;
    doc["deviceRole"] = deviceRole;
    doc["cameraIp"] = WiFi.localIP().toString();
    doc["snapshotUrl"] = String("http://") + WiFi.localIP().toString() + "/api/camera/capture";
    doc["timestamp"] = millis();
    if (motionEvent) {
        doc["changedBlocks"] = motionEvent->changedBlocks;
        doc["changePercentage"] = motionEvent->changePercentage;
        if (motionEvent->snapshotPath.length() > 0) {
            doc["snapshotPath"] = motionEvent->snapshotPath;
        }
    }

    String payload;
    serializeJson(doc, payload);

    if (globalBrokerClient) {
        globalBrokerClient->broadcastMessage("alerts", payload.c_str());
    }

    const uint16_t alertPort = udpRuntimeGetBoundParentPort();
    if (alertPort > 0) {
        WiFiUDP& udp = udpRuntimeSocket();
        udp.beginPacket(IPAddress(255, 255, 255, 255), alertPort);
        udp.write((const uint8_t*)payload.c_str(), payload.length());
        udp.endPacket();
    }

    Serial.printf("[DOORBELL] Alert emitted: %s\n", eventType);
}

void onDoorbellMotionDetected(const MotionEvent& event) {
    emitDoorbellAlert("person", &event);
}

void pollDoorbellButton() {
    const bool readingPressed = digitalRead(DOORBELL_BUTTON_PIN) == DOORBELL_BUTTON_ACTIVE_LEVEL;
    const unsigned long now = millis();

    if (readingPressed != doorbellButtonLastReading) {
        doorbellButtonLastReading = readingPressed;
        doorbellButtonLastChangeMs = now;
    }

    if ((now - doorbellButtonLastChangeMs) < DOORBELL_BUTTON_DEBOUNCE_MS) {
        return;
    }

    if (readingPressed != doorbellButtonStablePressed) {
        doorbellButtonStablePressed = readingPressed;
        if (doorbellButtonStablePressed) {
            emitDoorbellAlert("doorbell");
        }
    }
}

