scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
bool startDoorbellDisplayStream(const String& host, uint16_t port, unsigned long intervalMs) {
    if (!cameraService.isInitialized() || host.length() == 0) return false;

    if (!cameraService.isStreaming() && !cameraService.startVideoStream(static_cast<int>(intervalMs))) {
        return false;
    }

    doorbellDisplayStreamHost = host;
    doorbellDisplayStreamPort = port;
    doorbellDisplayStreamIntervalMs = intervalMs;
    doorbellDisplayStreamLastFrameMs = 0;
    doorbellDisplayStreamFramesSent = 0;
    doorbellDisplayStreamFailures = 0;
    doorbellDisplayStreamLastStatus = 0;
    Serial.printf("[DOORBELL] Display stream started: %s:%u every %lums\n",
                  host.c_str(), port, intervalMs);
    return true;
}

void stopDoorbellDisplayStream() {
    cameraService.stopVideoStream();
    doorbellDisplayStreamHost = "";
    doorbellDisplayStreamLastFrameMs = 0;
    Serial.println("[DOORBELL] Display stream stopped");
}

void pollDoorbellDisplayStream() {
    if (!cameraService.isStreaming() || doorbellDisplayStreamHost.length() == 0) return;

    const unsigned long now = millis();
    if (doorbellDisplayStreamLastFrameMs != 0
        && now - doorbellDisplayStreamLastFrameMs < doorbellDisplayStreamIntervalMs) {
        return;
    }
    doorbellDisplayStreamLastFrameMs = now;

    uint8_t* jpeg = nullptr;
    size_t jpegLength = 0;
    if (!cameraService.captureToBuffer(&jpeg, &jpegLength)) {
        doorbellDisplayStreamFailures++;
        doorbellDisplayStreamLastStatus = -1;
        return;
    }

    const String url = String("http://") + doorbellDisplayStreamHost + ":"
        + String(doorbellDisplayStreamPort) + "/api/doorbell/frame";
    HTTPClient http;
    http.setTimeout(4000);
    int status = -1;
    if (http.begin(url)) {
        http.addHeader("Content-Type", "image/jpeg");
        status = http.POST(jpeg, jpegLength);
        http.end();
    }
    free(jpeg);

    doorbellDisplayStreamLastStatus = status;
    if (status >= 200 && status < 300) {
        doorbellDisplayStreamFramesSent++;
    } else {
        doorbellDisplayStreamFailures++;
        Serial.printf("[DOORBELL] Display frame delivery failed: HTTP %d\n", status);
    }
}
#endif

#if defined(ENABLE_DOORBELL_DISPLAY)
bool fetchUrlToBuffer(const String& url, uint8_t** buffer, size_t* length) {
    if (!buffer || !length) {
        return false;
    }

    *buffer = nullptr;
    *length = 0;

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient client;
    if (!http.begin(client, url)) {
#else
    if (!http.begin(url)) {
#endif
        return false;
    }

    http.setTimeout(5000);
    const int code = http.GET();
    if (code != HTTP_CODE_OK) {
        http.end();
        return false;
    }

    const int totalLength = http.getSize();
    if (totalLength <= 0) {
        http.end();
        return false;
    }

    uint8_t* data = static_cast<uint8_t*>(malloc(static_cast<size_t>(totalLength)));
    if (!data) {
        http.end();
        return false;
    }

    WiFiClient* stream = http.getStreamPtr();
    size_t offset = 0;
    while (http.connected() && offset < static_cast<size_t>(totalLength)) {
        const size_t available = stream->available();
        if (available == 0) {
            delay(1);
            continue;
        }

        const size_t toRead = min(available, static_cast<size_t>(totalLength) - offset);
        const size_t readCount = stream->readBytes(reinterpret_cast<char*>(data + offset), toRead);
        offset += readCount;
    }

    http.end();

    if (offset != static_cast<size_t>(totalLength)) {
        free(data);
        return false;
    }

    *buffer = data;
    *length = offset;
    return true;
}

void handleDoorbellAlertPacket(const String& payload, IPAddress sourceIp, uint16_t sourcePort) {
    JsonDocument doc;
    if (deserializeJson(doc, payload)) {
        Serial.println("[DOORBELL] Ignoring malformed alert payload");
        return;
    }

    const String eventType = String(doc["eventType"] | doc["kind"] | "person");
    const String snapshotUrl = String(doc["snapshotUrl"] | "");

    doorbellLastAlertType = eventType;
    doorbellLastSnapshotUrl = snapshotUrl;
    doorbellLastAlertMs = millis();

    Serial.printf("[DOORBELL] Alert received from %s:%u type=%s\n", sourceIp.toString().c_str(), sourcePort, eventType.c_str());

    if (!displayService.isInitialized()) {
        return;
    }

    if (snapshotUrl.length() == 0) {
        displayService.showInfo("Doorbell alert received");
        return;
    }

    uint8_t* jpegBuffer = nullptr;
    size_t jpegLength = 0;
    if (!fetchUrlToBuffer(snapshotUrl, &jpegBuffer, &jpegLength)) {
        displayService.showError("Failed to fetch camera JPEG");
        return;
    }

    const bool shown = displayService.showJpeg(jpegBuffer, jpegLength, 0, 0);
    free(jpegBuffer);

    if (!shown) {
        displayService.showError("Failed to render camera JPEG");
    }
}
#endif

void updateProbeResult(SupervisorProbeState& probe, bool healthy, int statusCode, const String& errorText) {
    probe.healthy = healthy;
    probe.lastStatusCode = statusCode;
    probe.lastCheckMs = millis();
    probe.lastError = errorText;
    if (healthy) probe.okCount++;
    else probe.failCount++;
}

void probeHttpTarget(SupervisorProbeState& probe) {
    if (probe.url.length() == 0) {
        updateProbeResult(probe, false, -1, "probe url not configured");
        return;
    }

    if (WiFi.status() != WL_CONNECTED) {
        updateProbeResult(probe, false, -1, "wifi disconnected");
        return;
    }

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient probeClient;
    if (!http.begin(probeClient, probe.url)) {
#else
    if (!http.begin(probe.url)) {
#endif
        updateProbeResult(probe, false, -1, "http begin failed");
        return;
    }

    http.setTimeout(2500);
    const int code = http.GET();
    const bool ok = code >= 200 && code < 500;
    String err;
    if (!ok) {
        err = String("http code ") + String(code);
    }
    updateProbeResult(probe, ok, code, err);
    http.end();
}

bool parseUrlHostPort(const String& url, String& hostOut, uint16_t& portOut) {
    const int schemeSep = url.indexOf("://");
    const int hostStart = schemeSep >= 0 ? schemeSep + 3 : 0;
    const int pathStart = url.indexOf('/', hostStart);
    const String hostPort = pathStart >= 0 ? url.substring(hostStart, pathStart) : url.substring(hostStart);
    if (hostPort.length() == 0) {
        return false;
    }

    const int colon = hostPort.lastIndexOf(':');
    if (colon > 0) {
        hostOut = hostPort.substring(0, colon);
        const int parsedPort = hostPort.substring(colon + 1).toInt();
        if (parsedPort <= 0 || parsedPort > 65535) {
            return false;
        }
        portOut = static_cast<uint16_t>(parsedPort);
        return true;
    }

    hostOut = hostPort;
    if (schemeSep >= 0 && url.substring(0, schemeSep).equalsIgnoreCase("https")) {
        portOut = 443;
    } else {
        portOut = 80;
    }
    return true;
}

void probeTcpTarget(SupervisorProbeState& probe) {
    if (probe.url.length() == 0) {
        updateProbeResult(probe, false, -1, "probe url not configured");
        return;
    }

