scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
    if (WiFi.status() != WL_CONNECTED) {
        updateProbeResult(probe, false, -1, "wifi disconnected");
        return;
    }

    String host;
    uint16_t port = 0;
    if (!parseUrlHostPort(probe.url, host, port)) {
        updateProbeResult(probe, false, -1, "invalid probe url");
        return;
    }

    WiFiClient client;
    client.setTimeout(2500);
    const bool ok = client.connect(host.c_str(), port);
    if (ok) {
        updateProbeResult(probe, true, 200, "");
        client.stop();
        return;
    }

    updateProbeResult(probe, false, -11, "tcp connect failed");
}

void postSupervisorHeartbeat() {
    if (!isSupervisorRole() || !supervisorEnabled) {
        return;
    }

    if (supervisorHeartbeatUrl.length() == 0) {
        return;
    }

    if (WiFi.status() != WL_CONNECTED) {
        supervisorLastHeartbeatStatusCode = -1;
        supervisorHeartbeatFailCount++;
        supervisorLastHeartbeatError = "wifi disconnected";
        return;
    }

    JsonDocument doc;
    doc["nodeId"] = nodeName;
    doc["nodeName"] = nodeName;
    doc["ip"] = WiFi.localIP().toString();
    doc["deviceRole"] = deviceRole;
    doc["overallHealthy"] = supervisorOverallHealthy();

    auto supervisor = doc["supervisor"].to<JsonObject>();
    appendSupervisorStatus(supervisor);

    String body;
    serializeJson(doc, body);

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient supervisorClient;
    if (!http.begin(supervisorClient, supervisorHeartbeatUrl)) {
#else
    if (!http.begin(supervisorHeartbeatUrl)) {
#endif
        supervisorLastHeartbeatStatusCode = -1;
        supervisorHeartbeatFailCount++;
        supervisorLastHeartbeatError = "heartbeat begin failed";
        return;
    }

    http.addHeader("Content-Type", "application/json");
    http.setTimeout(2500);
    const int code = http.POST((uint8_t*)body.c_str(), body.length());
    supervisorLastHeartbeatPostMs = millis();
    supervisorLastHeartbeatStatusCode = code;

    if (code >= 200 && code < 300) {
        supervisorHeartbeatOkCount++;
        supervisorLastHeartbeatError = "";
    } else {
        supervisorHeartbeatFailCount++;
        supervisorLastHeartbeatError = String("http code ") + String(code);
    }

    http.end();
}

void runSupervisorHealthChecks() {
    if (!isSupervisorRole() || !supervisorEnabled) {
        return;
    }

    const unsigned long now = millis();
    if (now - supervisorLastRunMs < supervisorCheckIntervalMs) {
        return;
    }
    supervisorLastRunMs = now;

    probeHttpTarget(supervisorBackendProbe);
    probeTcpTarget(supervisorFrontendProbe);
    postSupervisorHeartbeat();
}

bool supervisorOverallHealthy() {
    if (!isSupervisorRole() || !supervisorEnabled) {
        return true;
    }
    if (!supervisorBackendProbe.healthy) {
        return false;
    }
    if (!supervisorRequireFrontend) {
        return true;
    }
    return supervisorFrontendProbe.healthy;
}

void appendSupervisorStatus(JsonObject obj) {
    obj["enabled"] = supervisorEnabled;
    obj["checkIntervalMs"] = static_cast<uint32_t>(supervisorCheckIntervalMs);
    obj["lastRunMs"] = static_cast<uint32_t>(supervisorLastRunMs);
    obj["overallHealthy"] = supervisorOverallHealthy();
    obj["requireFrontend"] = supervisorRequireFrontend;
    obj["heartbeatUrl"] = supervisorHeartbeatUrl;
    obj["lastHeartbeatStatusCode"] = supervisorLastHeartbeatStatusCode;
    obj["lastHeartbeatPostMs"] = static_cast<uint32_t>(supervisorLastHeartbeatPostMs);
    obj["heartbeatOkCount"] = static_cast<uint32_t>(supervisorHeartbeatOkCount);
    obj["heartbeatFailCount"] = static_cast<uint32_t>(supervisorHeartbeatFailCount);
    obj["lastHeartbeatError"] = supervisorLastHeartbeatError;

    auto targets = obj["targets"].to<JsonArray>();

    auto b = targets.add<JsonObject>();
    b["name"] = supervisorBackendProbe.name;
    b["url"] = supervisorBackendProbe.url;
    b["healthy"] = supervisorBackendProbe.healthy;
    b["lastStatusCode"] = supervisorBackendProbe.lastStatusCode;
    b["lastCheckMs"] = static_cast<uint32_t>(supervisorBackendProbe.lastCheckMs);
    b["okCount"] = static_cast<uint32_t>(supervisorBackendProbe.okCount);
    b["failCount"] = static_cast<uint32_t>(supervisorBackendProbe.failCount);
    b["lastError"] = supervisorBackendProbe.lastError;

    auto f = targets.add<JsonObject>();
    f["name"] = supervisorFrontendProbe.name;
    f["url"] = supervisorFrontendProbe.url;
    f["healthy"] = supervisorFrontendProbe.healthy;
    f["lastStatusCode"] = supervisorFrontendProbe.lastStatusCode;
    f["lastCheckMs"] = static_cast<uint32_t>(supervisorFrontendProbe.lastCheckMs);
    f["okCount"] = static_cast<uint32_t>(supervisorFrontendProbe.okCount);
    f["failCount"] = static_cast<uint32_t>(supervisorFrontendProbe.failCount);
    f["lastError"] = supervisorFrontendProbe.lastError;
}

struct BonecrusherWorkerConfig {
    bool enabled = false;
    String queueManagerUrl = "http://192.168.2.11:4100";
    String queueName = "swift.mt103.inbound";
    String workerId = "";
    uint32_t leaseMs = 30000;
    uint32_t pollIntervalMs = 250;
    uint32_t heartbeatMs = 4000;
    uint32_t processTimeoutMs = 60000;
    uint32_t retryDelayMs = 1000;
    uint32_t maxAttempts = 5;
};

struct BonecrusherWorkerStats {
    uint32_t claimAttempts = 0;
    uint32_t claimed = 0;
    uint32_t completed = 0;
    uint32_t failed = 0;
    uint32_t requeued = 0;
    uint32_t deadLettered = 0;
    uint32_t heartbeatsSent = 0;
    int lastQueueHttpCode = 0;
    int lastEdgeHttpCode = 0;
    unsigned long lastRunMs = 0;
    String lastError;
};

BonecrusherWorkerConfig bonecrusherConfig;
BonecrusherWorkerStats bonecrusherStats;
const char* bonecrusherConfigPath = "/bonecrusher-worker-config.json";
const char* esp32GatewayConfigPath = "/esp32-gateway-workers.json";

struct Esp32GatewayWorkerEntry {
    String gatewayId;
    BonecrusherWorkerConfig worker;
    BonecrusherWorkerStats stats;
};

std::vector<Esp32GatewayWorkerEntry> esp32GatewayWorkers;
bool esp32GatewayWorkersEnabled = false;
uint32_t esp32GatewayIdleDelayMs = 250;
#if defined(ESP32)
TaskHandle_t esp32GatewayWorkerTaskHandle = nullptr;
#endif

constexpr size_t ESP32_GATEWAY_WORKER_MAX = 8;
#if defined(ESP32)
TaskHandle_t bonecrusherWorkerTaskHandle = nullptr;
#endif

bool isBonecrusherRole() {
#ifdef DISABLE_BONECRUSHER
    return false;
#else
    const String role = String(deviceRole);
    return role.equalsIgnoreCase("bonecrusher") || role.equalsIgnoreCase("generalist");
#endif
}

