scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
String percentEncode(const String& in) {
    String out;
    out.reserve(in.length() * 3);
    for (size_t i = 0; i < in.length(); ++i) {
        const uint8_t c = static_cast<uint8_t>(in[i]);
        const bool unreserved =
            (c >= 'A' && c <= 'Z') ||
            (c >= 'a' && c <= 'z') ||
            (c >= '0' && c <= '9') ||
            c == '-' || c == '_' || c == '.' || c == '~';
        if (unreserved) {
            out += static_cast<char>(c);
            continue;
        }
        char buf[4];
        snprintf(buf, sizeof(buf), "%%%02X", c);
        out += buf;
    }
    return out;
}

String trimTrailingSlash(const String& value) {
    String out = value;
    while (out.endsWith("/")) {
        out.remove(out.length() - 1);
    }
    return out;
}

void initializeBonecrusherWorkerDefaults() {
    bonecrusherConfig.enabled = isBonecrusherRole();
    bonecrusherConfig.workerId = nodeName.length() > 0 ? nodeName : "bonecrusher-worker";
}

BonecrusherWorkerConfig makeDefaultGatewayWorkerConfig(size_t index) {
    BonecrusherWorkerConfig cfg;
    cfg.enabled = true;
    cfg.queueManagerUrl = bonecrusherConfig.queueManagerUrl;
    cfg.queueName = String("gateway.in.") + String(static_cast<unsigned long>(index + 1));
    cfg.workerId = String("esp32-gateway-") + String(static_cast<unsigned long>(index + 1));
    cfg.leaseMs = bonecrusherConfig.leaseMs;
    cfg.pollIntervalMs = bonecrusherConfig.pollIntervalMs;
    cfg.heartbeatMs = bonecrusherConfig.heartbeatMs;
    cfg.processTimeoutMs = bonecrusherConfig.processTimeoutMs;
    cfg.retryDelayMs = bonecrusherConfig.retryDelayMs;
    cfg.maxAttempts = bonecrusherConfig.maxAttempts;
    return cfg;
}

void saveEsp32GatewayWorkersConfig() {
    JsonDocument doc;
    doc["enabled"] = esp32GatewayWorkersEnabled;
    doc["idleDelayMs"] = esp32GatewayIdleDelayMs;
    JsonArray gateways = doc["gateways"].to<JsonArray>();
    for (size_t i = 0; i < esp32GatewayWorkers.size(); ++i) {
        const auto& gw = esp32GatewayWorkers[i];
        JsonObject g = gateways.add<JsonObject>();
        g["gatewayId"] = gw.gatewayId;
        g["enabled"] = gw.worker.enabled;
        g["queueManagerUrl"] = gw.worker.queueManagerUrl;
        g["queueName"] = gw.worker.queueName;
        g["workerId"] = gw.worker.workerId;
        g["leaseMs"] = gw.worker.leaseMs;
        g["pollIntervalMs"] = gw.worker.pollIntervalMs;
        g["heartbeatMs"] = gw.worker.heartbeatMs;
        g["processTimeoutMs"] = gw.worker.processTimeoutMs;
        g["retryDelayMs"] = gw.worker.retryDelayMs;
        g["maxAttempts"] = gw.worker.maxAttempts;
    }

    File f = LittleFS.open(esp32GatewayConfigPath, "w");
    if (!f) {
        Serial.println("[ESP32-GATEWAY] Failed to save config");
        return;
    }
    serializeJson(doc, f);
    f.close();
}

void loadEsp32GatewayWorkersConfig() {
    esp32GatewayWorkers.clear();
    // Open in append+read mode so first boot creates the file silently
    // instead of emitting a VFS missing-file error.
    File f = LittleFS.open(esp32GatewayConfigPath, "a+");
    if (!f) return;

    if (f.size() == 0) {
        f.close();
        return;
    }

    f.seek(0, SeekSet);

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) {
        Serial.println("[ESP32-GATEWAY] Failed to parse gateway config, ignoring");
        return;
    }

    if (doc["enabled"].is<bool>()) {
        esp32GatewayWorkersEnabled = doc["enabled"].as<bool>();
    }
    if (doc["idleDelayMs"].is<uint32_t>()) {
        esp32GatewayIdleDelayMs = doc["idleDelayMs"].as<uint32_t>();
    }

    JsonArray gateways = doc["gateways"].as<JsonArray>();
    if (gateways.isNull()) return;

    for (JsonObject g : gateways) {
        if (esp32GatewayWorkers.size() >= ESP32_GATEWAY_WORKER_MAX) break;
        Esp32GatewayWorkerEntry entry;
        entry.gatewayId = String(g["gatewayId"] | "");
        entry.worker = makeDefaultGatewayWorkerConfig(esp32GatewayWorkers.size());
        if (g["enabled"].is<bool>()) entry.worker.enabled = g["enabled"].as<bool>();
        if (g["queueManagerUrl"].is<const char*>()) entry.worker.queueManagerUrl = g["queueManagerUrl"].as<const char*>();
        if (g["queueName"].is<const char*>()) entry.worker.queueName = g["queueName"].as<const char*>();
        if (g["workerId"].is<const char*>()) entry.worker.workerId = g["workerId"].as<const char*>();
        if (g["leaseMs"].is<uint32_t>()) entry.worker.leaseMs = g["leaseMs"].as<uint32_t>();
        if (g["pollIntervalMs"].is<uint32_t>()) entry.worker.pollIntervalMs = g["pollIntervalMs"].as<uint32_t>();
        if (g["heartbeatMs"].is<uint32_t>()) entry.worker.heartbeatMs = g["heartbeatMs"].as<uint32_t>();
        if (g["processTimeoutMs"].is<uint32_t>()) entry.worker.processTimeoutMs = g["processTimeoutMs"].as<uint32_t>();
        if (g["retryDelayMs"].is<uint32_t>()) entry.worker.retryDelayMs = g["retryDelayMs"].as<uint32_t>();
        if (g["maxAttempts"].is<uint32_t>()) entry.worker.maxAttempts = g["maxAttempts"].as<uint32_t>();

        if (entry.gatewayId.length() == 0) {
            entry.gatewayId = entry.worker.workerId.length() ? entry.worker.workerId : String("gateway-") + String(static_cast<unsigned long>(esp32GatewayWorkers.size() + 1));
        }
        if (entry.worker.workerId.length() == 0) {
            entry.worker.workerId = entry.gatewayId;
        }
        esp32GatewayWorkers.push_back(entry);
    }
}

void appendGatewayWorkerJson(JsonObject obj, const Esp32GatewayWorkerEntry& gw) {
    obj["gatewayId"] = gw.gatewayId;
    obj["enabled"] = gw.worker.enabled;
    obj["queueManagerUrl"] = gw.worker.queueManagerUrl;
    obj["queueName"] = gw.worker.queueName;
    obj["workerId"] = gw.worker.workerId;
    obj["leaseMs"] = gw.worker.leaseMs;
    obj["pollIntervalMs"] = gw.worker.pollIntervalMs;
    obj["heartbeatMs"] = gw.worker.heartbeatMs;
    obj["processTimeoutMs"] = gw.worker.processTimeoutMs;
    obj["retryDelayMs"] = gw.worker.retryDelayMs;
    obj["maxAttempts"] = gw.worker.maxAttempts;
    JsonObject stats = obj["stats"].to<JsonObject>();
    stats["claimAttempts"] = gw.stats.claimAttempts;
    stats["claimed"] = gw.stats.claimed;
    stats["completed"] = gw.stats.completed;
    stats["failed"] = gw.stats.failed;
    stats["requeued"] = gw.stats.requeued;
    stats["deadLettered"] = gw.stats.deadLettered;
    stats["heartbeatsSent"] = gw.stats.heartbeatsSent;
    stats["lastQueueHttpCode"] = gw.stats.lastQueueHttpCode;
    stats["lastEdgeHttpCode"] = gw.stats.lastEdgeHttpCode;
    stats["lastRunMs"] = static_cast<uint32_t>(gw.stats.lastRunMs);
    stats["lastError"] = gw.stats.lastError;
}

