scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
void saveBonecrusherWorkerConfig() {
    JsonDocument doc;
    doc["enabled"] = bonecrusherConfig.enabled;
    doc["queueManagerUrl"] = bonecrusherConfig.queueManagerUrl;
    doc["queueName"] = bonecrusherConfig.queueName;
    doc["workerId"] = bonecrusherConfig.workerId;
    doc["leaseMs"] = bonecrusherConfig.leaseMs;
    doc["pollIntervalMs"] = bonecrusherConfig.pollIntervalMs;
    doc["heartbeatMs"] = bonecrusherConfig.heartbeatMs;
    doc["processTimeoutMs"] = bonecrusherConfig.processTimeoutMs;
    doc["retryDelayMs"] = bonecrusherConfig.retryDelayMs;
    doc["maxAttempts"] = bonecrusherConfig.maxAttempts;

    File f = LittleFS.open(bonecrusherConfigPath, "w");
    if (!f) {
        Serial.println("[BONECRUSHER] Failed to save worker config");
        return;
    }
    serializeJson(doc, f);
    f.close();
}

void loadBonecrusherWorkerConfig() {
    if (!LittleFS.exists(bonecrusherConfigPath)) return;

    File f = LittleFS.open(bonecrusherConfigPath, "r");
    if (!f) return;

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) {
        Serial.println("[BONECRUSHER] Failed to parse worker config, using defaults");
        return;
    }

    if (doc["enabled"].is<bool>()) bonecrusherConfig.enabled = doc["enabled"].as<bool>();
    if (doc["queueManagerUrl"].is<const char*>()) bonecrusherConfig.queueManagerUrl = doc["queueManagerUrl"].as<const char*>();
    if (doc["queueName"].is<const char*>()) bonecrusherConfig.queueName = doc["queueName"].as<const char*>();
    if (doc["workerId"].is<const char*>()) bonecrusherConfig.workerId = doc["workerId"].as<const char*>();
    if (doc["leaseMs"].is<uint32_t>()) bonecrusherConfig.leaseMs = doc["leaseMs"].as<uint32_t>();
    if (doc["pollIntervalMs"].is<uint32_t>()) bonecrusherConfig.pollIntervalMs = doc["pollIntervalMs"].as<uint32_t>();
    if (doc["heartbeatMs"].is<uint32_t>()) bonecrusherConfig.heartbeatMs = doc["heartbeatMs"].as<uint32_t>();
    if (doc["processTimeoutMs"].is<uint32_t>()) bonecrusherConfig.processTimeoutMs = doc["processTimeoutMs"].as<uint32_t>();
    if (doc["retryDelayMs"].is<uint32_t>()) bonecrusherConfig.retryDelayMs = doc["retryDelayMs"].as<uint32_t>();
    if (doc["maxAttempts"].is<uint32_t>()) bonecrusherConfig.maxAttempts = doc["maxAttempts"].as<uint32_t>();
}

int httpPostJson(const String& url, const String& body, String& responseBody, uint16_t timeoutMs = 4000) {
#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
    if (WiFi.status() != WL_CONNECTED && !url.startsWith("http://127.0.0.1")) {
        return bluetoothControlPlaneHttpPost(url, body, responseBody, timeoutMs);
    }
#endif
    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient postJsonClient;
    if (!http.begin(postJsonClient, url)) return -1;
#else
    if (!http.begin(url)) return -1;
#endif
    http.addHeader("Content-Type", "application/json");
    http.setTimeout(timeoutMs);
    const int code = http.POST(body);
    responseBody = (code > 0) ? http.getString() : "";
    http.end();
#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
    if (code <= 0
        && !url.startsWith("http://127.0.0.1")
        && bluetoothControlPlaneClientConnected()) {
        return bluetoothControlPlaneHttpPost(url, body, responseBody, timeoutMs);
    }
#endif
    return code;
}

int httpPostForm(const String& url, const String& body, String& responseBody, uint16_t timeoutMs = 6000) {
    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient postFormClient;
    if (!http.begin(postFormClient, url)) return -1;
#else
    if (!http.begin(url)) return -1;
#endif
    http.addHeader("Content-Type", "application/x-www-form-urlencoded");
    http.setTimeout(timeoutMs);
    const int code = http.POST(body);
    responseBody = (code > 0) ? http.getString() : "";
    http.end();
    return code;
}

int httpGet(const String& url, String& responseBody, uint16_t timeoutMs = 4000) {
    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient getClient;
    if (!http.begin(getClient, url)) return -1;
#else
    if (!http.begin(url)) return -1;
#endif
    http.setTimeout(timeoutMs);
    const int code = http.GET();
    responseBody = (code > 0) ? http.getString() : "";
    http.end();
    return code;
}

bool processClaimWithLocalIngress(
    const String& claimToken,
    const String& queuePayload,
    const String& inputQueue,
    String& processError,
    int& lastEdgeCode
) {
    const String stageUrl = "http://127.0.0.1/pmachine/edge_ingress_stage";
    String form = "inputQueue=" + percentEncode(inputQueue);
    form += "&message=" + percentEncode(queuePayload);
    form += "&runRouter=1&async=1&convertMtToXml=0";

    String stageResponse;
    const int stageCode = httpPostForm(stageUrl, form, stageResponse, 6000);
    lastEdgeCode = stageCode;
    if (stageCode < 200 || stageCode >= 300) {
        processError = String("edge stage submit failed: ") + String(stageCode) + " " + stageResponse;
        return false;
    }

    JsonDocument stageDoc;
    if (deserializeJson(stageDoc, stageResponse)) {
        processError = "edge stage submit parse failed";
        return false;
    }

    String jobId = stageDoc["jobId"] | "";
    if (jobId.length() == 0) {
        processError = "edge stage missing jobId";
        return false;
    }

    const unsigned long started = millis();
    unsigned long lastHeartbeat = 0;
    const String qmBase = trimTrailingSlash(bonecrusherConfig.queueManagerUrl);

    while (millis() - started < bonecrusherConfig.processTimeoutMs) {
        if (millis() - lastHeartbeat >= bonecrusherConfig.heartbeatMs) {
            JsonDocument hbDoc;
            hbDoc["queueName"] = bonecrusherConfig.queueName;
            hbDoc["workerId"] = bonecrusherConfig.workerId;
            hbDoc["claimToken"] = claimToken;
            hbDoc["extendMs"] = bonecrusherConfig.leaseMs;
            String hbBody;
            serializeJson(hbDoc, hbBody);
            String hbResp;
            int hbCode = httpPostJson(qmBase + "/claim/heartbeat", hbBody, hbResp, 3000);
            if (hbCode > 0) {
                bonecrusherStats.heartbeatsSent += 1;
                bonecrusherStats.lastQueueHttpCode = hbCode;
            }
            lastHeartbeat = millis();
        }

        String statusResponse;
        const int statusCode = httpGet("http://127.0.0.1/pmachine/edge_ingress_status?jobId=" + percentEncode(jobId), statusResponse, 4000);
        lastEdgeCode = statusCode;
        if (statusCode <= 0) {
            delay(150);
            continue;
        }

