scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
        JsonDocument statusDoc;
        if (deserializeJson(statusDoc, statusResponse)) {
            delay(150);
            continue;
        }

        String state = statusDoc["state"] | "";
        int innerStatus = statusDoc["statusCode"] | statusCode;
        if (state == "completed") {
            if (innerStatus >= 200 && innerStatus < 300) {
                return true;
            }
            String body = statusDoc["body"] | "";
            processError = String("edge stage failed: ") + String(innerStatus) + " " + body;
            return false;
        }

        delay(120);
    }

    processError = "edge stage timed out";
    return false;
}

void runBonecrusherWorkerIteration() {
    if (!isBonecrusherRole() || !bonecrusherConfig.enabled) return;
    if (WiFi.status() != WL_CONNECTED
#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
        && !bluetoothControlPlaneClientConnected()
#endif
    ) return;

    const String qmBase = trimTrailingSlash(bonecrusherConfig.queueManagerUrl);

    JsonDocument claimDoc;
    claimDoc["queueName"] = bonecrusherConfig.queueName;
    claimDoc["workerId"] = bonecrusherConfig.workerId;
    claimDoc["leaseMs"] = bonecrusherConfig.leaseMs;
    String claimBody;
    serializeJson(claimDoc, claimBody);

    String claimResponse;
    bonecrusherStats.claimAttempts += 1;
    const int claimCode = httpPostJson(qmBase + "/claim", claimBody, claimResponse, 4000);
    bonecrusherStats.lastQueueHttpCode = claimCode;

    if (claimCode == 404) return; // no work
    if (claimCode < 200 || claimCode >= 300) {
        bonecrusherStats.lastError = String("claim failed ") + String(claimCode) + " " + claimResponse;
        return;
    }

    JsonDocument claimRespDoc;
    if (deserializeJson(claimRespDoc, claimResponse)) {
        bonecrusherStats.lastError = "claim response parse failed";
        return;
    }

    String claimToken = claimRespDoc["claim"]["claimToken"] | "";
    String inputQueue = claimRespDoc["claim"]["message"]["messageEnvelope"]["inputQueue"] | "";
    JsonVariant msgVariant = claimRespDoc["claim"]["message"]["message"];
    String queuePayload;
    if (msgVariant.is<const char*>()) {
        queuePayload = msgVariant.as<const char*>();
    } else {
        serializeJson(msgVariant, queuePayload);
        if (inputQueue.length() == 0) {
            inputQueue = claimRespDoc["claim"]["message"]["message"]["inputQueue"] | "";
        }
        if (queuePayload.length() == 0) {
            queuePayload = claimRespDoc["claim"]["message"]["message"].as<String>();
        }
    }

    if (inputQueue.length() == 0) {
        inputQueue = bonecrusherConfig.queueName;
    }

    if (claimToken.length() == 0 || queuePayload.length() == 0) {
        bonecrusherStats.lastError = "claim payload missing token or message";
        return;
    }

    bonecrusherStats.claimed += 1;
    bonecrusherStats.lastRunMs = millis();

    String processError;
    int edgeCode = 0;
    bool ok = processClaimWithLocalIngress(claimToken, queuePayload, inputQueue, processError, edgeCode);
    bonecrusherStats.lastEdgeHttpCode = edgeCode;

    JsonDocument finishDoc;
    finishDoc["queueName"] = bonecrusherConfig.queueName;
    finishDoc["workerId"] = bonecrusherConfig.workerId;
    finishDoc["claimToken"] = claimToken;

    if (ok) {
        JsonObject completionMeta = finishDoc["completionMeta"].to<JsonObject>();
        completionMeta["edgeHttpCode"] = edgeCode;
        completionMeta["nodeName"] = nodeName;
        String finishBody;
        serializeJson(finishDoc, finishBody);
        String finishResp;
        int finishCode = httpPostJson(qmBase + "/claim/complete", finishBody, finishResp, 4000);
        bonecrusherStats.lastQueueHttpCode = finishCode;
        if (finishCode >= 200 && finishCode < 300) {
            bonecrusherStats.completed += 1;
            bonecrusherStats.lastError = "";
        } else {
            bonecrusherStats.lastError = String("complete failed ") + String(finishCode) + " " + finishResp;
        }
        return;
    }

    finishDoc["reason"] = processError;
    finishDoc["delayMs"] = bonecrusherConfig.retryDelayMs;
    finishDoc["maxAttempts"] = bonecrusherConfig.maxAttempts;
    String failBody;
    serializeJson(finishDoc, failBody);
    String failResp;
    int failCode = httpPostJson(qmBase + "/claim/fail", failBody, failResp, 4000);
    bonecrusherStats.lastQueueHttpCode = failCode;
    bonecrusherStats.failed += 1;

    if (failCode >= 200 && failCode < 300) {
        JsonDocument failDoc;
        if (!deserializeJson(failDoc, failResp)) {
            String status = failDoc["status"] | "";
            if (status == "requeued") bonecrusherStats.requeued += 1;
            if (status == "dead-letter") bonecrusherStats.deadLettered += 1;
        }
    }
    bonecrusherStats.lastError = processError;
}

void runEsp32GatewayWorkersIteration() {
    if (!isBonecrusherRole() || !esp32GatewayWorkersEnabled) return;
    if (WiFi.status() != WL_CONNECTED
#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
        && !bluetoothControlPlaneClientConnected()
#endif
    ) return;
    if (esp32GatewayWorkers.empty()) return;

    for (size_t i = 0; i < esp32GatewayWorkers.size(); ++i) {
        auto& gw = esp32GatewayWorkers[i];
        if (!gw.worker.enabled) continue;

        BonecrusherWorkerConfig prevConfig = bonecrusherConfig;
        BonecrusherWorkerStats prevStats = bonecrusherStats;

        bonecrusherConfig = gw.worker;
        bonecrusherStats = gw.stats;
        runBonecrusherWorkerIteration();
        gw.worker = bonecrusherConfig;
        gw.stats = bonecrusherStats;

        bonecrusherConfig = prevConfig;
        bonecrusherStats = prevStats;
    }
}

#if defined(ESP32)
void bonecrusherWorkerTask(void* param) {
    (void)param;
    for (;;) {
        if (esp32GatewayWorkersEnabled && !esp32GatewayWorkers.empty()) {
            runEsp32GatewayWorkersIteration();
        } else {
            runBonecrusherWorkerIteration();
        }
        const uint32_t delayMs = esp32GatewayWorkersEnabled
          ? (esp32GatewayIdleDelayMs > 20 ? esp32GatewayIdleDelayMs : 20)
          : (bonecrusherConfig.enabled ? (bonecrusherConfig.pollIntervalMs > 20 ? bonecrusherConfig.pollIntervalMs : 20) : 1000);
        vTaskDelay(pdMS_TO_TICKS(delayMs));
    }
}

void startBonecrusherWorkerTaskIfNeeded() {
    if (!isBonecrusherRole()) return;
    if (bonecrusherWorkerTaskHandle != nullptr) return;
    constexpr uint32_t bonecrusherWorkerStackBytes = 12288;
    BaseType_t ok = xTaskCreatePinnedToCore(
        bonecrusherWorkerTask,
        "bonecrusherWorker",
        bonecrusherWorkerStackBytes,
        nullptr,
        1,
        &bonecrusherWorkerTaskHandle,
        1
    );
    if (ok != pdPASS) {
        ok = xTaskCreate(
            bonecrusherWorkerTask,
            "bonecrusherWorker",
            bonecrusherWorkerStackBytes,
            nullptr,
            1,
            &bonecrusherWorkerTaskHandle
        );
    }
    if (ok == pdPASS) {
        Serial.println("[BONECRUSHER] Worker task started");
    } else {
        Serial.println("[BONECRUSHER] Worker task failed to start");
    }
}

