scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
    auto handleLedAction = [](AsyncWebServerRequest *request){
        String action;
        if (request->hasParam("action", true)) {
            action = request->getParam("action", true)->value();
        } else if (request->hasParam("action")) {
            action = request->getParam("action")->value();
        }
        action.trim();
        if (action.length() == 0) {
            request->send(400, "application/json", "{\"error\":\"action is required\"}");
            return;
        }

        const int ledPinNumber = 2;
        String valueParam;
        if (request->hasParam("value", true)) {
            valueParam = request->getParam("value", true)->value();
        } else if (request->hasParam("value")) {
            valueParam = request->getParam("value")->value();
        }
        valueParam.trim();

        Serial.printf("[LEDPIN] Received action=%s value=%s\n", action.c_str(), valueParam.c_str());

        // Always configure the LED pin as output before any state change.
        pinMode(ledPinNumber, OUTPUT);

        bool nextOn = false;
        if (action.equalsIgnoreCase("raise") || action.equalsIgnoreCase("turnOn") || action.equalsIgnoreCase("on")) {
            nextOn = true;
        } else if (action.equalsIgnoreCase("lower") || action.equalsIgnoreCase("turnOff") || action.equalsIgnoreCase("off")) {
            nextOn = false;
        } else if (action.equalsIgnoreCase("set_output")) {
            const String lowered = valueParam;
            if (lowered.equalsIgnoreCase("1") || lowered.equalsIgnoreCase("high") || lowered.equalsIgnoreCase("on") || lowered.equalsIgnoreCase("true")) {
                nextOn = true;
            } else if (lowered.equalsIgnoreCase("0") || lowered.equalsIgnoreCase("low") || lowered.equalsIgnoreCase("off") || lowered.equalsIgnoreCase("false")) {
                nextOn = false;
            } else {
                request->send(400, "application/json", "{\"error\":\"set_output requires value=0|1|low|high|off|on|false|true\"}");
                return;
            }
        } else {
            request->send(400, "application/json", "{\"error\":\"unsupported LED action\"}");
            return;
        }

        digitalWrite(ledPinNumber, nextOn ? HIGH : LOW);
        Serial.printf("[LEDPIN] Pin %d set to %s\n", ledPinNumber, nextOn ? "HIGH" : "LOW");

        JsonDocument doc;
        doc["status"] = "ok";
        doc["device"] = "LEDPIN";
        doc["action"] = action;
        doc["pin"] = ledPinNumber;
        doc["state"] = nextOn ? "on" : "off";
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    };

#if defined(ENABLE_DOORBELL_CAMERA)
    server.on("/api/doorbell/display-stream/start", HTTP_POST, [](AsyncWebServerRequest *request) {
        if (!request->hasParam("target")) {
            request->send(400, "application/json", "{\"ok\":false,\"error\":\"target is required\"}");
            return;
        }

        String target = request->getParam("target")->value();
        target.trim();
        const int requestedPort = request->hasParam("port")
            ? request->getParam("port")->value().toInt()
            : 80;
        const unsigned long requestedInterval = request->hasParam("intervalMs")
            ? request->getParam("intervalMs")->value().toInt()
            : 500;
        if (target.length() == 0 || requestedPort < 1 || requestedPort > 65535
            || requestedInterval < 250 || requestedInterval > 5000) {
            request->send(400, "application/json", "{\"ok\":false,\"error\":\"invalid target, port, or intervalMs\"}");
            return;
        }

        const bool started = startDoorbellDisplayStream(
            target,
            static_cast<uint16_t>(requestedPort),
            requestedInterval);
        String response = String("{\"ok\":") + (started ? "true" : "false")
            + ",\"streaming\":" + (cameraService.isStreaming() ? "true" : "false")
            + ",\"target\":\"" + doorbellDisplayStreamHost + "\""
            + ",\"port\":" + String(doorbellDisplayStreamPort)
            + ",\"intervalMs\":" + String(doorbellDisplayStreamIntervalMs) + "}";
        request->send(started ? 200 : 503, "application/json", response);
    });

    server.on("/api/doorbell/display-stream/stop", HTTP_POST, [](AsyncWebServerRequest *request) {
        stopDoorbellDisplayStream();
        request->send(200, "application/json", "{\"ok\":true,\"streaming\":false}");
    });

    server.on("/api/doorbell/display-stream/status", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;
        doc["ok"] = true;
        doc["streaming"] = cameraService.isStreaming() && doorbellDisplayStreamHost.length() > 0;
        doc["target"] = doorbellDisplayStreamHost;
        doc["port"] = doorbellDisplayStreamPort;
        doc["intervalMs"] = static_cast<uint32_t>(doorbellDisplayStreamIntervalMs);
        doc["framesSent"] = static_cast<uint32_t>(doorbellDisplayStreamFramesSent);
        doc["failures"] = static_cast<uint32_t>(doorbellDisplayStreamFailures);
        doc["lastStatus"] = doorbellDisplayStreamLastStatus;
        String response;
        serializeJson(doc, response);
        request->send(200, "application/json", response);
    });
#endif

#ifdef ENABLE_DISPLAY
    server.on("/api/doorbell/frame", HTTP_POST, [](AsyncWebServerRequest *request) {}, nullptr,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
            constexpr size_t kMaxFrameJpegBytes = 24 * 1024;
            uint8_t *frame = reinterpret_cast<uint8_t *>(request->_tempObject);

            if (index == 0) {
                if (total == 0 || total > kMaxFrameJpegBytes) {
                    request->send(413, "application/json", "{\"ok\":false,\"error\":\"frame is empty or too large\"}");
                    return;
                }
                frame = static_cast<uint8_t *>(malloc(total));
                request->_tempObject = frame;
                if (!frame) {
                    request->send(500, "application/json", "{\"ok\":false,\"error\":\"frame allocation failed\"}");
                    return;
                }
            }

            if (!frame || index + len > total) {
                if (frame) free(frame);
                request->_tempObject = nullptr;
                request->send(400, "application/json", "{\"ok\":false,\"error\":\"invalid frame body\"}");
                return;
            }
            memcpy(frame + index, data, len);
            if ((index + len) < total) return;

