scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
        auto stats = doc["stats"].to<JsonObject>();
        stats["claimAttempts"] = bonecrusherStats.claimAttempts;
        stats["claimed"] = bonecrusherStats.claimed;
        stats["completed"] = bonecrusherStats.completed;
        stats["failed"] = bonecrusherStats.failed;
        stats["requeued"] = bonecrusherStats.requeued;
        stats["deadLettered"] = bonecrusherStats.deadLettered;
        stats["heartbeatsSent"] = bonecrusherStats.heartbeatsSent;
        stats["lastQueueHttpCode"] = bonecrusherStats.lastQueueHttpCode;
        stats["lastEdgeHttpCode"] = bonecrusherStats.lastEdgeHttpCode;
        stats["lastRunMs"] = static_cast<uint32_t>(bonecrusherStats.lastRunMs);
        stats["lastError"] = bonecrusherStats.lastError;

        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    server.on("/bonecrusher/worker/config", HTTP_POST, [](AsyncWebServerRequest *request){
        if (request->hasParam("enabled", true)) {
            bonecrusherConfig.enabled = parseBoolValue(request->getParam("enabled", true)->value());
        }
        if (request->hasParam("queueManagerUrl", true)) {
            bonecrusherConfig.queueManagerUrl = request->getParam("queueManagerUrl", true)->value();
        }
        if (request->hasParam("queueName", true)) {
            bonecrusherConfig.queueName = request->getParam("queueName", true)->value();
        }
        if (request->hasParam("workerId", true)) {
            bonecrusherConfig.workerId = request->getParam("workerId", true)->value();
        }
        if (request->hasParam("leaseMs", true)) {
            bonecrusherConfig.leaseMs = static_cast<uint32_t>(request->getParam("leaseMs", true)->value().toInt());
        }
        if (request->hasParam("pollIntervalMs", true)) {
            bonecrusherConfig.pollIntervalMs = static_cast<uint32_t>(request->getParam("pollIntervalMs", true)->value().toInt());
        }
        if (request->hasParam("heartbeatMs", true)) {
            bonecrusherConfig.heartbeatMs = static_cast<uint32_t>(request->getParam("heartbeatMs", true)->value().toInt());
        }
        if (request->hasParam("processTimeoutMs", true)) {
            bonecrusherConfig.processTimeoutMs = static_cast<uint32_t>(request->getParam("processTimeoutMs", true)->value().toInt());
        }
        if (request->hasParam("retryDelayMs", true)) {
            bonecrusherConfig.retryDelayMs = static_cast<uint32_t>(request->getParam("retryDelayMs", true)->value().toInt());
        }
        if (request->hasParam("maxAttempts", true)) {
            bonecrusherConfig.maxAttempts = static_cast<uint32_t>(request->getParam("maxAttempts", true)->value().toInt());
        }

        if (bonecrusherConfig.workerId.length() == 0) {
            bonecrusherConfig.workerId = nodeName;
        }

        bool persist = true;
        if (request->hasParam("persist", true)) {
            persist = parseBoolValue(request->getParam("persist", true)->value());
        }
        if (persist) {
            saveBonecrusherWorkerConfig();
        }

        JsonDocument doc;
        doc["updated"] = true;
        doc["persisted"] = persist;
        doc["enabled"] = bonecrusherConfig.enabled;
        doc["queueManagerUrl"] = bonecrusherConfig.queueManagerUrl;
        doc["queueName"] = bonecrusherConfig.queueName;
        doc["workerId"] = bonecrusherConfig.workerId;
        doc["leaseMs"] = bonecrusherConfig.leaseMs;
        doc["pollIntervalMs"] = bonecrusherConfig.pollIntervalMs;
        doc["heartbeatMs"] = bonecrusherConfig.heartbeatMs;
        doc["processTimeoutMs"] = bonecrusherConfig.processTimeoutMs;
        doc["retryDelayMs"] = bonecrusherConfig.retryDelayMs;
        doc["maxAttempts"] = bonecrusherConfig.maxAttempts;

        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    server.on("/esp32/gateways/status", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        doc["role"] = deviceRole;
        doc["enabled"] = esp32GatewayWorkersEnabled;
        doc["idleDelayMs"] = esp32GatewayIdleDelayMs;
        doc["count"] = static_cast<unsigned long>(esp32GatewayWorkers.size());
        doc["max"] = static_cast<unsigned long>(ESP32_GATEWAY_WORKER_MAX);
        JsonArray gateways = doc["gateways"].to<JsonArray>();
        for (size_t i = 0; i < esp32GatewayWorkers.size(); ++i) {
            JsonObject g = gateways.add<JsonObject>();
            appendGatewayWorkerJson(g, esp32GatewayWorkers[i]);
        }
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    server.on("/esp32/gateways/config", HTTP_POST, [](AsyncWebServerRequest *request){
        if (request->hasParam("enabled", true)) {
            esp32GatewayWorkersEnabled = parseBoolValue(request->getParam("enabled", true)->value());
        }
        if (request->hasParam("idleDelayMs", true)) {
            const uint32_t parsed = static_cast<uint32_t>(request->getParam("idleDelayMs", true)->value().toInt());
            esp32GatewayIdleDelayMs = parsed > 20 ? parsed : 20;
        }

        if (request->hasParam("configJson", true)) {
            String configJson = request->getParam("configJson", true)->value();
            JsonDocument doc;
            DeserializationError err = deserializeJson(doc, configJson);
            if (err) {
                request->send(400, "application/json", String("{\"error\":\"Invalid configJson: ") + err.c_str() + "\"}");
                return;
            }

            if (doc["enabled"].is<bool>()) {
                esp32GatewayWorkersEnabled = doc["enabled"].as<bool>();
            }
            if (doc["idleDelayMs"].is<uint32_t>()) {
                const uint32_t parsed = doc["idleDelayMs"].as<uint32_t>();
                esp32GatewayIdleDelayMs = parsed > 20 ? parsed : 20;
            }

            JsonArray arr = doc["gateways"].as<JsonArray>();
            if (!arr.isNull()) {
                esp32GatewayWorkers.clear();
                for (JsonObject g : arr) {
                    if (esp32GatewayWorkers.size() >= ESP32_GATEWAY_WORKER_MAX) break;
                    Esp32GatewayWorkerEntry entry;
                    entry.gatewayId = String(g["gatewayId"] | "");
                    entry.worker = makeDefaultGatewayWorkerConfig(esp32GatewayWorkers.size());
                    if (g["enabled"].is<bool>()) entry.worker.enabled = g["enabled"].as<bool>();
                    if (g["queueManagerUrl"].is<const char*>()) entry.worker.queueManagerUrl = g["queueManagerUrl"].as<const char*>();
                    if (g["queueName"].is<const char*>()) entry.worker.queueName = g["queueName"].as<const char*>();
                    if (g["workerId"].is<const char*>()) entry.worker.workerId = g["workerId"].as<const char*>();
                    if (g["leaseMs"].is<uint32_t>()) entry.worker.leaseMs = g["leaseMs"].as<uint32_t>();
                    if (g["pollIntervalMs"].is<uint32_t>()) entry.worker.pollIntervalMs = g["pollIntervalMs"].as<uint32_t>();
                    if (g["heartbeatMs"].is<uint32_t>()) entry.worker.heartbeatMs = g["heartbeatMs"].as<uint32_t>();
                    if (g["processTimeoutMs"].is<uint32_t>()) entry.worker.processTimeoutMs = g["processTimeoutMs"].as<uint32_t>();
                    if (g["retryDelayMs"].is<uint32_t>()) entry.worker.retryDelayMs = g["retryDelayMs"].as<uint32_t>();
                    if (g["maxAttempts"].is<uint32_t>()) entry.worker.maxAttempts = g["maxAttempts"].as<uint32_t>();

                    if (entry.gatewayId.length() == 0) {
                        entry.gatewayId = entry.worker.workerId.length() ? entry.worker.workerId : String("gateway-") + String(static_cast<unsigned long>(esp32GatewayWorkers.size() + 1));
                    }
                    if (entry.worker.workerId.length() == 0) {
                        entry.worker.workerId = entry.gatewayId;
                    }
                    esp32GatewayWorkers.push_back(entry);
                }
            }
        }

        bool persist = true;
        if (request->hasParam("persist", true)) {
            persist = parseBoolValue(request->getParam("persist", true)->value());
        }
        if (persist) {
            saveEsp32GatewayWorkersConfig();
        }

        JsonDocument out;
        out["updated"] = true;
        out["persisted"] = persist;
        out["enabled"] = esp32GatewayWorkersEnabled;
        out["idleDelayMs"] = esp32GatewayIdleDelayMs;
        out["count"] = static_cast<unsigned long>(esp32GatewayWorkers.size());
        JsonArray gateways = out["gateways"].to<JsonArray>();
        for (size_t i = 0; i < esp32GatewayWorkers.size(); ++i) {
            JsonObject g = gateways.add<JsonObject>();
            appendGatewayWorkerJson(g, esp32GatewayWorkers[i]);
        }
        String json;
        serializeJson(out, json);
        request->send(200, "application/json", json);
    });
    #endif

    #ifndef DISABLE_FFS_ROUTES
    registerFFSRoutes(server, federatedFS);
    #endif
#ifdef ENABLE_PMACHINE
#ifndef DISABLE_PMACHINE_ROUTES
    registerPMachineRoutes(server, pm, &federatedFS);
#endif
#endif
    server.onNotFound(notFound);
    
#ifdef ENABLE_CAMERA
    setupCameraRoutes(server);
    Serial.println("[CAMERA] Camera routes registered");
#endif

