scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#ifdef ENABLE_AWS_IOT
    registerAwsIotRoutes(server);
    Serial.println("[AWS_IOT] AWS IoT routes registered");
#endif

#ifdef ENABLE_PRINTER_SCANNER
    registerPrinterRoutes(server);
    Serial.println("[PRINTER] Printer/Scanner routes registered");
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
#if !defined(DISABLE_BLE_AUDIO_TTS)
    registerBluetoothRoutes(server);
    Serial.println("[BLUETOOTH] Bluetooth routes registered");
#endif
#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
    if (globalBluetoothAudioTtsService) {
        registerBluetoothAudioTtsRoutes(server, *globalBluetoothAudioTtsService);
        Serial.println("[BLUETOOTH-AUDIO] Bluetooth Audio/TTS routes registered");
    }
#endif
#ifdef ENABLE_EVENT_SCHEDULER
    registerSchedulerRoutes(server);
    Serial.println("[SCHEDULER] Scheduler routes registered");
#endif
#endif

    #ifndef DISABLE_WIFI_PROVISIONING
    registerWiFiProvisioningRoutes(server);
    Serial.println("[WIFI-PROV] WiFi provisioning routes registered");
    #else
    Serial.println("[WIFI-PROV] Disabled by build flag");
    #endif

#if defined(ENABLE_HTTPS) && (defined(ESP32) || defined(ESP8266))
    registerHttpsTlsRoutes(server);
#endif

    server.begin();
}


#define ANNOUNCE_INTERVAL 10000 // ms
#define WIFI_RECONNECT_INTERVAL 5000 // ms
constexpr unsigned long WIFI_FAILOVER_INTERVAL_MS = 15000;

constexpr uint16_t DEFAULT_UDP_PARENT_PORT = 4210;
constexpr uint16_t DEFAULT_UDP_SIBLING_PORT = 4211;
constexpr unsigned long TOPOLOGY_SYNC_INTERVAL_MS = 60000;

uint16_t runtimeUdpParentPort = DEFAULT_UDP_PARENT_PORT;
uint16_t runtimeUdpSiblingPort = DEFAULT_UDP_SIBLING_PORT;
unsigned long lastTopologySyncMs = 0;

unsigned long lastAnnounce = 0;
unsigned long lastWifiFailoverAttemptMs = 0;

#if 0 // UDP announcement and discovery disabled
#define ANNOUNCE_PORT 4210
#define ANNOUNCE_INTERVAL 10000 // ms
WiFiUDP udp;
unsigned long lastAnnounce = 0;
void processIncomingUDP() {
    int packetSize = udp.parsePacket();
    if (packetSize) {
        char incoming[128];
        int len = udp.read(incoming, sizeof(incoming) - 1);
        if (len > 0) {
            incoming[len] = 0;
            Serial.print("Received UDP announcement: ");
            Serial.println(incoming);
            // ...existing code for processing announcement...
        }
    }
}
void announcePresence() {
    String msg = nodeName + "," + WiFi.macAddress() + "," + WiFi.localIP().toString();
    udp.beginPacket("255.255.255.255", ANNOUNCE_PORT);
    udp.write((const uint8_t*)msg.c_str(), msg.length());
    udp.endPacket();
}
#endif

void announcePresence() {
    if (!udpRuntimeEnsureReady(runtimeUdpParentPort, runtimeUdpSiblingPort)) {
        return;
    }

    const String capabilityHash = computeNodeCapabilityHash();
    UdpAnnouncementState state = udpRuntimeGetAnnouncementState();

    if (sendNodeBeaconAnnouncement(
        udpRuntimeSocket(),
        runtimeUdpParentPort,
        nodeName.c_str(),
        deviceRole,
        firmwareBuildStamp,
        capabilityHash,
        state,
        runtimeUdpParentPort,
        runtimeUdpSiblingPort)) {
        udpRuntimeApplyAnnouncementState(state);
    }
}

String getOriginFromUrl(const String& url) {
    const int scheme = url.indexOf("://");
    if (scheme < 0) return "";

    const int authorityStart = scheme + 3;
    if (authorityStart >= static_cast<int>(url.length())) return "";

    const int pathStart = url.indexOf('/', authorityStart);
    if (pathStart < 0) return url;
    return url.substring(0, pathStart);
}

bool isValidTopologyPortPair(uint16_t parentPort, uint16_t siblingPort) {
    if (parentPort < 4200) return false;
    if ((parentPort % 2) != 0) return false;
    if ((siblingPort % 2) != 1) return false;
    if (siblingPort != static_cast<uint16_t>(parentPort + 1)) return false;
    return true;
}

bool syncTopologyUdpPortsFromAggregator() {
    if (WiFi.status() != WL_CONNECTED) return false;

    const String backendOrigin = getOriginFromUrl(supervisorBackendProbe.url);
    if (backendOrigin.length() == 0) return false;

    const String localIp = WiFi.localIP().toString();
    const String topologyUrl = trimTrailingSlash(backendOrigin) + "/api/nodes";

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient topologyClient;
    if (!http.begin(topologyClient, topologyUrl)) {
#else
    if (!http.begin(topologyUrl)) {
#endif
        return false;
    }

    http.setTimeout(3000);
    const int code = http.GET();
    if (code < 200 || code >= 300) {
        http.end();
        return false;
    }

    const String body = http.getString();
    http.end();

    JsonDocument doc;
    if (deserializeJson(doc, body)) {
        return false;
    }

    if (!doc.is<JsonArray>()) {
        return false;
    }

    for (JsonObject node : doc.as<JsonArray>()) {
        const String nodeId = String(node["nodeId"] | "");
        const String nodeDisplayName = String(node["nodeName"] | "");
        const JsonVariantConst details = node["details"];
        const String nodeDetailsName = details.is<JsonObjectConst>() ? String(details["nodeName"] | "") : String();
        const String nodeIp = String(node["ip"] | "");

        const bool isSelf =
            (nodeId.length() > 0 && nodeId.equalsIgnoreCase(nodeName)) ||
            (nodeDisplayName.length() > 0 && nodeDisplayName.equalsIgnoreCase(nodeName)) ||
            (nodeDetailsName.length() > 0 && nodeDetailsName.equalsIgnoreCase(nodeName)) ||
            (nodeIp.length() > 0 && nodeIp.equals(localIp));

        if (!isSelf) continue;

        const uint16_t parentPort = static_cast<uint16_t>(node["topology"]["udp"]["parentPort"] | 0);
        const uint16_t siblingPort = static_cast<uint16_t>(node["topology"]["udp"]["siblingPort"] | 0);
        if (!isValidTopologyPortPair(parentPort, siblingPort)) {
            return false;
        }

        if (runtimeUdpParentPort != parentPort || runtimeUdpSiblingPort != siblingPort) {
            runtimeUdpParentPort = parentPort;
            runtimeUdpSiblingPort = siblingPort;
            udpRuntimeEnsureReady(runtimeUdpParentPort, runtimeUdpSiblingPort);
        }
        return true;
    }

