scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
    return false;
}

void writeDefaultDocIfMissing(const char* path, const char* content) {
    if (LittleFS.exists(path)) {
        return;
    }
    File file = LittleFS.open(path, "w");
    if (!file) {
        Serial.print("[DOCS] Failed to create ");
        Serial.println(path);
        return;
    }
    file.print(content);
    file.close();
}

void ensureDocsTreeAndDefaults() {
    if (!LittleFS.exists("/services/docs")) {
        LittleFS.mkdir("/services/docs");
    }
    if (!LittleFS.exists("/devices/docs")) {
        LittleFS.mkdir("/devices/docs");
    }

    writeDefaultDocIfMissing("/devices/docs/LEDPIN.txt", "Device: LEDPIN");
    writeDefaultDocIfMissing("/devices/docs/LEDPIN_set_output.txt", "Action: set_output");
    writeDefaultDocIfMissing("/devices/docs/LEDPIN_raise.txt", "Action: raise");
    writeDefaultDocIfMissing("/devices/docs/LEDPIN_lower.txt", "Action: lower");
    writeDefaultDocIfMissing("/devices/docs/RELAY.txt", "Device: RELAY (pin-controlled relay)");
    writeDefaultDocIfMissing("/devices/docs/RELAY_toggle.txt", "Action: toggle");
    writeDefaultDocIfMissing("/devices/docs/RELAY_turnOn.txt", "Action: turnOn");
    writeDefaultDocIfMissing("/devices/docs/RELAY_turnOff.txt", "Action: turnOff");
    writeDefaultDocIfMissing("/devices/docs/RELAY_fsm.txt", "FSM: off --turnOn--> on, on --turnOff--> off, off|on --toggle--> toggled state");

    writeDefaultDocIfMissing("/services/docs/ffs.txt", "Federated File System: provides distributed file storage and access.");
    writeDefaultDocIfMissing("/services/docs/ffs_listFiles.txt", "List all files in the file system.");
    writeDefaultDocIfMissing("/services/docs/ffs_write.txt", "Write data to a file.");
    writeDefaultDocIfMissing("/services/docs/ffs_read.txt", "Read data from a file.");
    writeDefaultDocIfMissing("/services/docs/ffs_remove.txt", "Remove a file from the file system.");
    writeDefaultDocIfMissing("/services/docs/ffs_sync.txt", "Synchronize file system to storage.");

    writeDefaultDocIfMissing("/services/docs/pmachine.txt", "PL/0-style virtual machine for executing pcode programs.");
    writeDefaultDocIfMissing("/services/docs/pmachine_loadProgram.txt", "Load a pcode program into the VM.");
    writeDefaultDocIfMissing("/services/docs/pmachine_run.txt", "Run the loaded program.");
    writeDefaultDocIfMissing("/services/docs/pmachine_singleStep.txt", "Execute a single instruction.");
    writeDefaultDocIfMissing("/services/docs/pmachine_setBreakpoint.txt", "Set a breakpoint at a given address.");
    writeDefaultDocIfMissing("/services/docs/pmachine_clearBreakpoint.txt", "Clear a breakpoint at a given address.");
    writeDefaultDocIfMissing("/services/docs/pmachine_getStatus.txt", "Get the current status of the VM.");

    writeDefaultDocIfMissing("/services/docs/sensor.txt", "Provides access to connected sensors (e.g., DHT22, BME280).");
    writeDefaultDocIfMissing("/services/docs/sensor_readSensor.txt", "Read values from a sensor.");
    writeDefaultDocIfMissing("/services/docs/sensor_resultToJson.txt", "Convert sensor result to JSON.");
}

void setup() {

    Serial.begin(115200);
    delay(100);
    Serial.println("[BOOT] setup() starting...");

    // 1. Mount filesystem (SD or LittleFS)
#if defined(ESP32)
    bool sdAvailable = false;
    if (SD.begin()) {
        Serial.println("SD card detected and mounted");
        sdAvailable = true;
    } else {
        Serial.println("No SD card detected, falling back to LittleFS");
    }
    if (!sdAvailable) {
        if (!ensureLittleFsInitialized()) {
            Serial.println("LittleFS mount failed");
            while (1) delay(1000);
        }
    }
#else
    if (!ensureLittleFsInitialized()) {
        Serial.println("LittleFS mount failed");
        while (1) delay(1000);
    }
#endif

#if defined(ESP32)
    if (!ensureLittleFsInitialized()) {
        Serial.println("LittleFS unavailable");
        while (1) delay(1000);
    }
#endif

    // Load persisted node identity early so provisioning AP/hostname can use it.
    if (loadNodeConfig(nodeConfig) && nodeConfig.nodeName.length()) {
        nodeName = nodeConfig.nodeName;
    } else {
        File f = LittleFS.open(NODE_NAME_PATH, "r");
        if (f) {
            String savedName = f.readString();
            f.close();
            savedName.trim();
            if (savedName.length()) {
                nodeName = savedName;
            }
        }
    }

    // 2. WiFi connection logic
    Serial.println("[BOOT] Connecting to WiFi...");
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    WiFi.persistent(false);
    WiFi.disconnect(true, true);
    delay(50);

    initializeWiFiProvisioning(nodeName.c_str());
    if (globalWiFiProvisioning) {
        globalWiFiProvisioning->eraseLegacyCredentialStores();
    }

    bool connected = false;
    if (globalWiFiProvisioning) {
        connected = globalWiFiProvisioning->connectWiFi(nullptr, 12);
        if (connected) {
            const WiFiCredentials& active = globalWiFiProvisioning->getCurrentCredentials();
            udpRuntimeConfigureWifiCredentials(active.ssid, active.password);
        }
    }

    if (!connected && wifiConfig.ssid.length() > 0) {
        Serial.println("[BOOT] Falling back to in-memory wifiConfig credentials");
        WiFi.begin(wifiConfig.ssid.c_str(), wifiConfig.password.c_str());
        udpRuntimeConfigureWifiCredentials(wifiConfig.ssid, wifiConfig.password);
        int retries = 0;
        while (WiFi.status() != WL_CONNECTED && retries < 20) {
            delay(500);
            Serial.print(".");
            retries++;
        }
    }

    Serial.println();
    if (WiFi.status() == WL_CONNECTED) {
        Serial.print("[BOOT] WiFi connected: ");
        Serial.println(WiFi.localIP());
    } else {
        Serial.println("[BOOT] WiFi connection failed (no usable provisioned profile)");
        String ssidBase = nodeName.length() ? nodeName : String("ESP32");
        ssidBase.replace(" ", "-");
        String apName = String("Pulse-") + ssidBase + "-Provision";
        if (apName.length() > 31) {
            apName = apName.substring(0, 31);
        }
        WiFi.mode(WIFI_AP_STA);
        const bool apStarted = WiFi.softAP(apName.c_str());
        if (apStarted) {
            Serial.printf("[WIFI-PROV] Provisioning AP started: %s\n", apName.c_str());
            Serial.printf("[WIFI-PROV] AP IP: %s\n", WiFi.softAPIP().toString().c_str());
        } else {
            Serial.printf("[WIFI-PROV] Failed to start provisioning AP: %s\n", apName.c_str());
        }
    }

    // 3. Ensure /devices, /services, and /flows directories exist at root at boot
    File root = LittleFS.open("/", "r");
    bool foundDevices = false, foundServices = false, foundFlows = false;
    Serial.println("Looking for services and devices");
    if (root && root.isDirectory()) {
        File entry = root.openNextFile();
        while (entry) {
            String name = String(entry.name());
            if (entry.isDirectory()) {
                if (name == "/devices") foundDevices = true;
                if (name == "/services") foundServices = true;
                if (name == "/flows") foundFlows = true;
            }
            entry = root.openNextFile();
        }
        root.close();
    }
    Serial.println("Making sure we have devices and services");
    if (!foundDevices) LittleFS.mkdir("/devices");
    if (!foundServices) LittleFS.mkdir("/services");
    if (!foundFlows) LittleFS.mkdir("/flows");
    ensureDocsTreeAndDefaults();

