scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#ifdef ENABLE_AWS_IOT
    Serial.println("[BOOT] Initializing AWS IoT Gateway...");
    if (initializeAwsIotGateway()) {
        Serial.println("[AWS_IOT] AWS IoT Gateway initialized successfully");
    } else {
        Serial.println("[AWS_IOT] AWS IoT Gateway initialization failed");
    }
#endif

    // Reserve network server tasks before display and BLE fragment the CYD heap.
    setupWebServer();
#if defined(ENABLE_HTTPS) && (defined(ESP32) || defined(ESP8266))
    if (startHttpsService()) {
        announcePresence();
    }
#endif

#ifdef ENABLE_DISPLAY
    Serial.println("[BOOT] Initializing display service...");
    if (displayService.begin()) {
        Serial.println("[DISPLAY] Display initialized successfully");
        
#ifndef DISPLAY_NO_LVGL
        // Initialize DDL Renderer
        Serial.println("[BOOT] Initializing DDL renderer...");
        if (ddlRenderer.begin(displayService.getLVGLDisplay())) {
            Serial.println("[DDL] DDL renderer initialized successfully");
            
            // Set up action callback
            ddlRenderer.setActionCallback([&](const String& action) {
                Serial.printf("[DDL] Action triggered: %s\n", action.c_str());
                // TODO: Handle actions (e.g., device.relay.toggle, system.refresh)
            });
            
            // Set up registry callback
            ddlRenderer.setRegistryCallback([&](const String& key, JsonVariant value) {
                Serial.printf("[DDL] Registry update from UI: %s = %s\n", key.c_str(), value.as<String>().c_str());
                // TODO: Update registry/pmachine state
            });
            
            // Load and render DDL
            if (LittleFS.exists("/display/example.ddl.json")) {
                Serial.println("[DDL] Loading example DDL...");
                if (ddlRenderer.loadDDL("/display/example.ddl.json")) {
                    ddlRenderer.render();
                    Serial.println("[DDL] DDL rendered successfully");
                } else {
                    Serial.println("[DDL] Failed to load DDL file");
                }
            } else {
                Serial.println("[DDL] No DDL file found, using embedded status dashboard");

                String statusDashboardDDL = R"({
                    "display": "NodeStatus",
                    "version": "1.0",
                    "layout": {
                        "type": "column",
                        "cards": [
                            {
                                "id": "statusCard",
                                "title": ")" + nodeName + R"(",
                                "subtitle": "Pulse ESP32 node status",
                                "content": [
                                    {"id":"transportStatus","type":"text","label":"Transport: starting"},
                                    {"id":"addressStatus","type":"text","label":"Address: starting"},
                                    {"id":"uptimeStatus","type":"text","label":"Uptime: 0h 0m 0s"},
                                    {"id":"heapStatus","type":"text","label":"Free heap: measuring"}
                                ]
                            }
                        ]
                    }
                })";

                if (ddlRenderer.parseDDL(statusDashboardDDL)) {
                    ddlRenderer.render();
                    displayStatusDashboardActive = true;
                    updateDisplayStatusDashboard(true);
                    Serial.println("[DDL] Embedded status dashboard rendered successfully");
                } else {
                    Serial.println("[DDL] Failed to parse embedded DDL");
                }
            }
        } else {
            Serial.println("[DDL] DDL renderer initialization failed");
        }
#else
        const String displayStatus = nodeName + "\n" + WiFi.localIP().toString() + "\nHTTPS: port 443";
        displayService.showStatus("Pulse CYD", displayStatus.c_str(), COLOR_CYAN);
        Serial.println("[DISPLAY] Lightweight HTTPS status screen rendered");
#endif // DISPLAY_NO_LVGL
    } else {
        Serial.println("[DISPLAY] Display initialization failed");
    }
#endif

#ifdef ENABLE_PRINTER_SCANNER
    Serial.println("[BOOT] Initializing Printer/Scanner service...");
    initializePrinterService();
    if (globalPrinterService) {
        Serial.println("[PRINTER] Printer/Scanner service initialized successfully");
        
        #ifdef ENABLE_AWS_IOT
        // Register Alexa handlers for printer/scanner control
        registerPrinterAlexaHandlers();
        #endif
    } else {
        Serial.println("[PRINTER] Printer/Scanner service initialization failed");
    }
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
#if !defined(DISABLE_BLE_AUDIO_TTS)
    Serial.println("[BOOT] Initializing Bluetooth service...");
    globalBluetoothService = new BluetoothService();
    if (globalBluetoothService && globalBluetoothService->begin()) {
        Serial.println("[BLUETOOTH] Bluetooth service initialized successfully");
    } else {
        Serial.println("[BLUETOOTH] Bluetooth service initialization failed");
        delete globalBluetoothService;
        globalBluetoothService = nullptr;
    }
#endif

#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
#if !defined(DISABLE_BLE_AUDIO_TTS)
    if (globalBluetoothService) {
        globalBluetoothService->setScanInterval(120000);
        globalBluetoothService->setScanDuration(5);
        globalBluetoothService->setAutoDiscovery(true);
        Serial.printf("[BLUETOOTH] Audio profile BLE scan config: auto=ON interval=%dms duration=%ds freeHeap=%lu\n",
                      globalBluetoothService->getScanInterval(),
                      globalBluetoothService->getScanDuration(),
                      static_cast<unsigned long>(ESP.getFreeHeap()));
    }
#else
    Serial.println("[BLUETOOTH] BLE device service disabled for classic-only audio profile");
#endif

    Serial.println("[BOOT] Initializing Bluetooth Audio/TTS service...");
    globalBluetoothAudioTtsService = new BluetoothAudioTtsService();
    if (globalBluetoothAudioTtsService && globalBluetoothAudioTtsService->begin()) {
        Serial.println("[BLUETOOTH-AUDIO] Bluetooth Audio/TTS service initialized successfully");
    } else {
        Serial.println("[BLUETOOTH-AUDIO] Bluetooth Audio/TTS service initialization failed");
        delete globalBluetoothAudioTtsService;
        globalBluetoothAudioTtsService = nullptr;
    }
#endif
#endif

