scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
#if defined(BT_CONTROL_PLANE_WIFI_FALLBACK_ONLY)
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("[BOOT] WiFi unavailable; initializing Bluetooth provisioning fallback...");
        initializeBluetoothControlPlane(nodeName);
    } else {
        Serial.println("[BOOT] Bluetooth provisioning fallback on standby while WiFi is connected");
    }
#else
    Serial.println("[BOOT] Initializing Bluetooth control plane...");
    initializeBluetoothControlPlane(nodeName);
#endif
#endif

#ifdef ENABLE_EVENT_SCHEDULER
    Serial.println("[BOOT] Initializing Event Scheduler service...");
    globalEventScheduler = new EventScheduler();
    if (globalEventScheduler && globalEventScheduler->begin()) {
        Serial.println("[SCHEDULER] Event Scheduler service initialized successfully");
#ifdef ENABLE_BLUETOOTH_DEVICES
        globalEventScheduler->setEventExecutor([](const ScheduledEvent& event) -> bool {
            if (!globalBluetoothService) {
                return false;
            }
            if (!event.deviceType.equalsIgnoreCase("bluetooth") && !event.deviceType.equalsIgnoreCase("ble")) {
                return false;
            }
            return globalBluetoothService->controlDevice(event.deviceId, event.action, event.params);
        });
        Serial.println("[SCHEDULER] Bluetooth executor bridge enabled");
#endif
    } else {
        Serial.println("[SCHEDULER] Event Scheduler service initialization failed");
        delete globalEventScheduler;
        globalEventScheduler = nullptr;
    }
#endif

    String advertisedServices = "[BOOT] Advertised services: ";
    bool firstAdvertised = true;
    if (ffsUp) {
        advertisedServices += "FFS";
        firstAdvertised = false;
    }
#ifdef ENABLE_PMACHINE
#ifndef DISABLE_PMACHINE_ROUTES
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "pmachine";
    advertisedServices += ", GenericRouterService";
    firstAdvertised = false;
#endif
#endif
#ifdef ENABLE_CAMERA
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "camera";
    firstAdvertised = false;
#endif
#ifdef ENABLE_PRINTER_SCANNER
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "printer-scanner";
    firstAdvertised = false;
#endif
#ifdef ENABLE_BLUETOOTH_DEVICES
#if !defined(DISABLE_BLE_AUDIO_TTS)
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "BluetoothService";
    firstAdvertised = false;
#endif
#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "BluetoothAudioTtsService";
    firstAdvertised = false;
#endif
#endif
#ifdef ENABLE_EVENT_SCHEDULER
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "EventScheduler";
    firstAdvertised = false;
#endif
#ifdef ENABLE_TIME_AUTHORITY
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "TimeAuthorityService";
    firstAdvertised = false;
#endif
#ifndef DISABLE_UNIQUE_ID_SERVICE
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "UniqueIdService";
    firstAdvertised = false;
#endif
    if (firstAdvertised) advertisedServices += "none";
    Serial.println(advertisedServices);

#if defined(ESP32) && !defined(DISABLE_BONECRUSHER)
    startEsp32GatewayWorkerTaskIfNeeded();
#endif
}

void loop() {
    serialProvisioningPoll();

#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE) && defined(BT_CONTROL_PLANE_WIFI_FALLBACK_ONLY)
    if (WiFi.status() != WL_CONNECTED && !globalBluetoothControlPlane) {
        Serial.println("[BLE-CP] WiFi lost; starting Bluetooth provisioning fallback");
        initializeBluetoothControlPlane(nodeName);
    }
#endif

    if (WiFi.status() != WL_CONNECTED && globalWiFiProvisioning) {
        const unsigned long now = millis();
        if (now - lastWifiFailoverAttemptMs >= WIFI_FAILOVER_INTERVAL_MS) {
            lastWifiFailoverAttemptMs = now;
            if (globalWiFiProvisioning->connectWiFi(nullptr, 10)) {
                const WiFiCredentials& active = globalWiFiProvisioning->getCurrentCredentials();
                udpRuntimeConfigureWifiCredentials(active.ssid, active.password);
                startOrRefreshMdns(nodeName);
            }
        }
    }

    if (WiFi.status() == WL_CONNECTED) {
        startOrRefreshMdns(nodeName);
    }

    udpRuntimeMaintainConnectivity(runtimeUdpParentPort, runtimeUdpSiblingPort, WIFI_RECONNECT_INTERVAL);

#ifdef ENABLE_TIME_AUTHORITY
    timeAuthorityLoop();
#endif

#ifdef ENABLE_AWS_IOT
    // Update AWS IoT Gateway (process MQTT messages)
    updateAwsIotGateway();
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
    // Update Bluetooth service (handle scanning and device discovery)
#if !defined(DISABLE_BLE_AUDIO_TTS)
    if (globalBluetoothService) {
        globalBluetoothService->loop();
    }
#endif
#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
    if (globalBluetoothAudioTtsService) {
        globalBluetoothAudioTtsService->loop();
    }
#endif
#endif

#if defined(ESP32) && defined(ENABLE_BT_CONTROL_PLANE)
    bluetoothControlPlaneLoop();
#endif

#ifdef ENABLE_EVENT_SCHEDULER
    // Update Event Scheduler (check and execute scheduled events)
    if (globalEventScheduler) {
        globalEventScheduler->loop();
    }
#endif

    // Non-blocking UDP receive for node discovery
    UdpRuntimeContext udpContext;
    udpContext.nodeName = nodeName.c_str();
    udpContext.deviceRole = deviceRole;
    udpContext.firmwareVersion = firmwareVersion;
    udpContext.firmwareBuildStamp = firmwareBuildStamp;
    udpContext.firmwareTrack = firmwareTrack;
    udpContext.discoveredNodeTable = &discoveredNodeTable;
    udpContext.computeNodeCapabilityHash = computeNodeCapabilityHash;
#if defined(ENABLE_DOORBELL_DISPLAY)
    udpContext.onAlertMessage = handleDoorbellAlertPacket;
#endif
    udpRuntimeProcessIncoming(udpContext, runtimeUdpParentPort, runtimeUdpSiblingPort);
        /* UDP announcement disabled */
        // processIncomingUDP();

#if defined(ENABLE_DOORBELL_CAMERA)
    pollDoorbellButton();
    pollDoorbellDisplayStream();
    if (!cameraService.isStreaming() && millis() - doorbellLastMotionCheckMs > 500) {
        MotionEvent motionEvent;
        if (cameraService.checkMotion(motionEvent)) {
            Serial.printf("[DOORBELL] Person alert: %d blocks changed (%.1f%%)\n",
                          motionEvent.changedBlocks, motionEvent.changePercentage);
        }
        doorbellLastMotionCheckMs = millis();
    }
#endif

    // Remove nodes not seen in last 10 minutes (600000 ms)
    unsigned long now = millis();
    for (auto it = discoveredNodeTable.begin(); it != discoveredNodeTable.end(); ) {
        if (now - it->second.lastSeen > 600000) {
            Serial.print("Node expired: ");
            Serial.println(it->second.mac);
            it = discoveredNodeTable.erase(it);
        } else {
            ++it;
        }
    }

    const unsigned long beaconInterval = udpRuntimeGetBeaconIntervalMs(
        NODE_BEACON_ACKED_INTERVAL_MS,
        NODE_BEACON_UNACKED_INTERVAL_MS);
    if (millis() - lastAnnounce > beaconInterval) {
        if (!isBonecrusherRole()) {
            announcePresence();
        }
        lastAnnounce = millis();
    }

    if (millis() - lastTopologySyncMs > TOPOLOGY_SYNC_INTERVAL_MS) {
        if (!isBonecrusherRole()) {
            syncTopologyUdpPortsFromAggregator();
        }
        lastTopologySyncMs = millis();
    }

    runSupervisorHealthChecks();
    
#if defined(ENABLE_DISPLAY) && !defined(DISPLAY_NO_LVGL)
    // Update LVGL (handles rendering and touch)
    displayService.update();
    updateDisplayStatusDashboard();
#endif

#ifdef ENABLE_PRINTER_SCANNER
    // Update printer/scanner service
    if (globalPrinterService) {
        globalPrinterService->loop();
    }
#endif
    // No need for server.handleClient() with AsyncWebServer
    // Add VM logic here
}

